# 포켓몬 정해보기
# ISTJ 요가램 => 일처리를 신중하고 책임감있고, 침착한 게 istj인데, 생김새만 봐도 침착하고 신중하게 생겼으며, 실제로 명상이라는 기술도 배움
# ISTP 레시라무 => 과묵하며 절제된 호기심으로 인생을 관찰하고, 상황을 파악하는 민감성과 도구를 다루는 뛰어난 능력이 있다는데, 레시라무는 컨셉부터가 제크라무와 같이 mbti에 적용하기 딱 좋은 포켓몬이기에 우선순위에 넣음(현실(s)을 상징), 실제로 진실된 세계를 만들어가는 사람을 관찰하여 도와주며 불을 다루는 데 있어서 뛰어남
# ISFJ 케르디오 => 타인을 향한 연민과 동정심이 있으면서도 가족이나 친구를 보호할 때는 단호하고 가차 없는 모습을 보인다고 하는데 실제로도 평상시 모습과 각오할 때의 모습이 따로 존재, 단호한 모습은 각오할 때와 동일해보임
# ISFP 해피너스 => 말없이 다정하고 온화하며, 사람들에게 친절하다고 함, 상대방을 잘 알게 될 때까지는 섣불리 내면을 보여주지 않는다고 하는데, 실제로 온화한 성격이며 포켓몬 게임에서 가까이 다가가면 멀리 도망치는 경향이 있음
# INTJ 아르세우스 => 더 좋은 방법을 찾는 과정에서 거절당하거나 규칙을 깨는 일을 두려워하지 않는다고 하는데, 아르세우스는 더 좋은 상성을 지정하고자 매우 많은 속성 관련 폼이 존재, 그리고 궁극기에 해당하는 심판의 포효를 많이 쓰거나 고효율기인 신속을 사용하는 방식이 존재
# INTP 메타그로스 => 조용하고 과묵하며, 논리와 분석으로 문제를 해결하기 좋아한다. 먼저 대화를 시작하지는 않는 편, 논리에 진심인 스타일인데 이 부분에 있어서는 메타그로스가 제격임, 애초에 컴퓨터 형태의 포켓몬인지라 논리 위주로 움직이며 과묵한 편
# INFJ 피카츄 => 인내심이 많고 통찰력과 직관력이 뛰어나며, 화합을 추구하는 유형이다. 창의력이 좋으며, 성숙한 경우에는 강한 직관력으로 타인에게 말없이도 큰 영향력을 끼친다고 하는데, 피카츄는 애니메이션에서도 그렇고 도감에서도 동료와의 유대감을 중요시하는 편, 단일 전기타입임에도 여러가지 타입의 기술들을 사용 가능, 피카츄 또는 진화체인 라이츄 관련 각종 바리에이션들도 존재하여 창의력, 또는 영향력이 큰 편으로 보임
# INFP 제크로무 => 이들의 가능성을 성취할 수 있도록 도우며, 세상을 더 나은 곳으로 만든다는데, 제크로무가 제격이라고 생각함, 제크라무는 컨셉부터가 레시라무와 같이 mbti에 적용하기 딱 좋은 포켓몬이기에 우선순위에 넣음(이상(n)을 상징), 실제로도 이상적인 세계를 만드는 사람을 보좌한다고 함
# ESTJ 대도각참 => 현실적, 구체적, 사실적이다. 또한 어떠한 활동을 조직화하고 주도해 나가는 지도력과 추진력이 있다고 함, 대도각참도 실제로 엄격하게 조직을 통솔하는 지도자의 느낌이 강함
# ESTP 플로젤 => 사실적이고 관대하며 개방적이고, 사람이나 사물에 대한 선입견이 별로 없고, 강한 현실 감각으로 타협책을 모색하고 문제를 해결하는 능력이 뛰어나다는 모험가형의 설명은 물 속에 빠진 사람들을 구해주며 거친 바다까지 헤엄치는 성격이 딱 모험가적 체질
# ESFJ 가디안 => 동정심이 많고 다른 사람에게 관심을 쏟으며, 나눔과 베풂을 중시한다. 타고난 협력자로서 동료애가 많고 친절하며 능동적인 구성원이라는 설명은 가디안이 적절해보임, 가디안은 트레이너에게 능동적으로써 관심을 가져주며 트레이너를 지켜주는 데에 목숨까지 걸 수 있다는 설정이 있음
# ESFP 이브이 => 사교적이고 활동적이며 수용력이 강하고, 친절하며 낙천적이며 어떤 상황이든 잘 적응하며 현실적이고 실질적이라고 함, 이브이도 어떤 상황에서도 변화가 가능하며 거다이맥스 설명에서는 누구에게나 친근하게 다가가서 장난을 친다고도 함
# ENTJ 대여르 => '타고난 리더'라고 불리는 이 유형은 권위와 자신감으로 역량을 발휘하고 또한 공통된 목표를 통해 사람들을 끌어모으는 통솔력을 행사함, 대여르가 적합해보이며, 실제로 리더의 권한은 절대적이라고 하며 팀워크를 잘 발휘한다고 함
# ENTP 초염몽 => 위풍당당하고 논리적인 언행, 당차고 소신 있는 성격, 엉뚱하지만 자신감 넘치는 태도, 최상위권의 지능을 활용한 아이디어 및 임기응변, 위트 있는 말솜씨 등으로 인해 주변에서 인기가 많고 분위기를 당당하게 주도하는 강강약약 스타일, 초염몽은 어떤 상대든 독특한 격투 기술을 사용하여 싸우며 씩씩한 느낌이 있기에 적절하다고 생각
# ENFJ 토게키스 => 온화하고 적극적이며 책임감이 강하다. 사교성이 풍부하고 동정심이 많다고 하는데 토게키스는 다툼이 없는 곳에서 은총을 베푸는 존재이기에 적절하다고 판단
# ENFP 불비달마 => 정열적이고 활기가 넘치며 상상력이 풍부하다. 온정적이고 창의적이며, 항상 새로운 가능성을 찾고 시도하는 유형이라고 함, 불비달마는 실제로 혈기왕성한 포켓몬이며, 명상모드로도 변신하여 마음을 갈고 닦아서 정신을 수양하고 있음


pokemon_data = [
    {
        "name": "",
        "mbti":"",
        "img":"",
        "description(mbti)":"",
        "description(pokemon)":""
    }
]
